package com.moataz.afternoonhadeeth.data.source

class NightHadiths {

    fun nightHadith(): String {
        val hadith = when (roll()) {
            1 -> "عَنْ عَائِشَةَ رضي الله عنها :\n" +
                    "\n" +
                    "( أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا أَوَى إِلَى فِرَاشِهِ كُلَّ لَيْلَةٍ : جَمَعَ كَفَّيْهِ ، ثُمَّ نَفَثَ فِيهِمَا ، فَقَرَأَ فِيهِمَا : قُلْ هُوَ اللَّهُ أَحَدٌ ، وَ قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ ، وَ قُلْ أَعُوذُ بِرَبِّ النَّاسِ ، ثُمَّ يَمْسَحُ بِهِمَا مَا اسْتَطَاعَ مِنْ جَسَدِهِ ، يَبْدَأُ بِهِمَا عَلَى رَأْسِهِ وَوَجْهِهِ وَمَا أَقْبَلَ مِنْ جَسَدِهِ ، يَفْعَلُ ذَلِكَ ثَلَاثَ مَرَّاتٍ) النفث : نفخ لطيف بلا ريق . رواه البخاري"
            2 -> "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ :\n" +
                    "\n" +
                    "( وَكَّلَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِحِفْظِ زَكَاةِ رَمَضَانَ ، فَأَتَانِي آتٍ ، فَجَعَلَ يَحْثُو مِنْ الطَّعَامِ ، فَأَخَذْتُهُ فَقُلْتُ : لَأَرْفَعَنَّكَ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ - فَذَكَرَ الْحَدِيثَ - فَقَالَ : إِذَا أَوَيْتَ إِلَى فِرَاشِكَ فَاقْرَأْ آيَةَ الْكُرْسِيِّ ، لَنْ يَزَالَ عَلَيْكَ مِنْ اللَّهِ حَافِظٌ ، وَلَا يَقْرَبُكَ شَيْطَانٌ حَتَّى تُصْبِحَ . فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : صَدَقَكَ وَهُوَ كَذُوبٌ ، ذَاكَ شَيْطَانٌ )\n" +
                    "\n" +
                    "رواه البخاري"
            3 -> "عَنْ أَبِي مَسْعُودٍ رَضِيَ اللَّهُ عَنْهُ قَالَ : قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\n" +
                    "\n" +
                    "( مَنْ قَرَأَ بِالْآيَتَيْنِ مِنْ آخِرِ سُورَةِ الْبَقَرَةِ فِي لَيْلَةٍ كَفَتَاهُ ) .  رواه البخاري"
            4 -> "عن نوفل الأشجعي رضي اللّه عنه قال : قال لي رسول اللّه صلى اللّه عليه وسلم :\n" +
                    "\n" +
                    "( اقْرأ : ( قُلْ يا أيُّها الكافِرُونَ ) ثُمَّ نَمْ على خاتِمَتِها ، فإنَّها بَرَاءَةٌ مِنَ الشِّرْكِ )\n" +
                    "\n" +
                    "رواه أبو داود"
            5 -> "عَنْ حُذَيْفَةَ بْنِ الْيَمَانِ رضي الله عنه قَالَ :\n" +
                    "\n" +
                    "( كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أَرَادَ أَنْ يَنَامَ قَالَ بِاسْمِكَ اللَّهُمَّ أَمُوتُ وَأَحْيَا وَإِذَا اسْتَيْقَظَ مِنْ مَنَامِهِ قَالَ الْحَمْدُ لِلَّهِ الَّذِي أَحْيَانَا بَعْدَ مَا أَمَاتَنَا وَإِلَيْهِ النُّشُورُ )\n" +
                    "\n" +
                    "رواه البخاري"
            6 -> "عَنْ الْبَرَاءِ بْنِ عَازِبٍ قَالَ : قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\n" +
                    "\n" +
                    "( إِذَا أَتَيْتَ مَضْجَعَكَ فَتَوَضَّأْ وُضُوءَكَ لِلصَّلَاةِ ، ثُمَّ اضْطَجِعْ عَلَى شِقِّكَ الْأَيْمَنِ ، ثُمَّ قُلْ : اللَّهُمَّ أَسْلَمْتُ وَجْهِي إِلَيْكَ : وَفَوَّضْتُ أَمْرِي إِلَيْكَ ، وَأَلْجَأْتُ ظَهْرِي إِلَيْكَ ، رَغْبَةً وَرَهْبَةً إِلَيْكَ ، لَا مَلْجَأَ وَلَا مَنْجَا مِنْكَ إِلَّا إِلَيْكَ ، اللَّهُمَّ آمَنْتُ بِكِتَابِكَ الَّذِي أَنْزَلْتَ ، وَبِنَبِيِّكَ الَّذِي أَرْسَلْتَ . فَإِنْ مُتَّ مِنْ لَيْلَتِكَ فَأَنْتَ عَلَى الْفِطْرَةِ ، وَاجْعَلْهُنَّ آخِرَ مَا تَتَكَلَّمُ بِهِ ، قَالَ : فَرَدَّدْتُهَا عَلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ، فَلَمَّا بَلَغْتُ : اللَّهُمَّ آمَنْتُ بِكِتَابِكَ الَّذِي أَنْزَلْتَ . قُلْتُ : وَرَسُولِكَ . قَالَ : لَا ، وَنَبِيِّكَ الَّذِي أَرْسَلْتَ ) رواه البخاري "
            7 -> "عَنْ أَبِي هُرَيْرَةَ رضي الله عنه قَالَ : قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\n" +
                    "\n" +
                    "( إِذَا أَوَى أَحَدُكُمْ إِلَى فِرَاشِهِ فَلْيَنْفُضْ فِرَاشَهُ بِدَاخِلَةِ إِزَارِهِ فَإِنَّهُ لَا يَدْرِي مَا خَلَفَهُ عَلَيْهِ ثُمَّ يَقُولُ : بِاسْمِكَ رَبِّ وَضَعْتُ جَنْبِي ، وَبِكَ أَرْفَعُهُ ، إِنْ أَمْسَكْتَ نَفْسِي فَارْحَمْهَا ، وَإِنْ أَرْسَلْتَهَا فَاحْفَظْهَا بِمَا تَحْفَظُ بِهِ عِبَادَكَ الصَّالِحِينَ )\n" +
                    "\n" +
                    "رواه البخاري"
            8 -> "عَنْ عَلِيِّ بْنِ أَبِي طَالِبٍ رضي الله عنه أَنَّ فَاطِمَةَ رضي الله عنها أَتَتْ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَسْأَلُهُ خَادِمًا ، فَقَالَ :\n" +
                    "\n" +
                    "( أَلَا أُخْبِرُكِ مَا هُوَ خَيْرٌ لَكِ مِنْهُ ، تُسَبِّحِينَ اللَّهَ عِنْدَ مَنَامِكِ ثَلَاثًا وَثَلَاثِينَ ، وَتَحْمَدِينَ اللَّهَ ثَلَاثًا وَثَلَاثِينَ ، وَتُكَبِّرِينَ اللَّهَ أَرْبَعًا وَثَلَاثِينَ . فَمَا تَرَكْتُهَا بَعْدُ . قِيلَ : وَلَا لَيْلَةَ صِفِّينَ ؟ قَالَ : وَلَا لَيْلَةَ صِفِّينَ )  رواه البخاري"
            9 -> "عَنْ حَفْصَةَ رضي الله عنها أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ إِذَا أَرَادَ أَنْ يَرْقُدَ وَضَعَ يَدَهُ الْيُمْنَى تَحْتَ خَدِّهِ ثُمَّ يَقُولُ : ( اللَّهُمَّ قِنِى عَذَابَكَ يَوْمَ تَبْعَثُ عِبَادَكَ ) ثَلاَثَ مِرَارٍ .\n" +
                    "\n" +
                    "رواه أبو داود"
            10 -> "عَنْ أَنَسٍ رضي الله عنه أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا أَوَى إِلَى فِرَاشِهِ قَالَ :\n" +
                    "\n" +
                    "( الْحَمْدُ لِلَّهِ الَّذِي أَطْعَمَنَا وَسَقَانَا وَكَفَانَا وَآوَانَا فَكَمْ مِمَّنْ لَا كَافِيَ لَهُ وَلَا مُؤْوِيَ )\n" +
                    "\n" +
                    "رواه مسلم"
            11 -> "عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ أَنَّهُ أَمَرَ رَجُلًا إِذَا أَخَذَ مَضْجَعَهُ قَالَ :\n" +
                    "\n" +
                    "( اللَّهُمَّ خَلَقْتَ نَفْسِي وَأَنْتَ تَوَفَّاهَا ، لَكَ مَمَاتُهَا وَمَحْيَاهَا ، إِنْ أَحْيَيْتَهَا فَاحْفَظْهَا ، وَإِنْ أَمَتَّهَا فَاغْفِرْ لَهَا ، اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَافِيَةَ )\n" +
                    "\n" +
                    "فَقَالَ لَهُ رَجُلٌ : أَسَمِعْتَ هَذَا مِنْ عُمَرَ ؟ فَقَالَ : مِنْ خَيْرٍ مِنْ عُمَرَ ، مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ .  رواه مسلم"
            12 -> "عن سهيل قال : كَانَ أَبُو صَالِحٍ يَأْمُرُنَا - إِذَا أَرَادَ أَحَدُنَا أَنْ يَنَامَ - أَنْ يَضْطَجِعَ عَلَى شِقِّهِ الْأَيْمَنِ ثُمَّ يَقُولُ :\n" +
                    "\n" +
                    "( اللَّهُمَّ رَبَّ السَّمَاوَاتِ وَرَبَّ الْأَرْضِ وَرَبَّ الْعَرْشِ الْعَظِيمِ ، رَبَّنَا وَرَبَّ كُلِّ شَيْءٍ ، فَالِقَ الْحَبِّ وَالنَّوَى ، وَمُنْزِلَ التَّوْرَاةِ وَالْإِنْجِيلِ وَالْفُرْقَانِ ، أَعُوذُ بِكَ مِنْ شَرِّ كُلِّ شَيْءٍ أَنْتَ آخِذٌ بِنَاصِيَتِهِ ، اللَّهُمَّ أَنْتَ الْأَوَّلُ فَلَيْسَ قَبْلَكَ شَيْءٌ ، وَأَنْتَ الْآخِرُ فَلَيْسَ بَعْدَكَ شَيْءٌ ، وَأَنْتَ الظَّاهِرُ فَلَيْسَ فَوْقَكَ شَيْءٌ ، وَأَنْتَ الْبَاطِنُ فَلَيْسَ دُونَكَ شَيْءٌ ، اقْضِ عَنَّا الدَّيْنَ ، وَأَغْنِنَا مِنْ الْفَقْرِ )\n" +
                    "\n" +
                    "وَكَانَ يَرْوِي ذَلِكَ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ. رواه مسلم"
            13 -> "عَنْ عَلِيٍّ رضي الله عنه عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ كَانَ يَقُولُ عِنْدَ مَضْجَعِهِ :\n" +
                    "\n" +
                    "( اللَّهُمَّ إِنِّي أَعُوذُ بِوَجْهِكَ الْكَرِيمِ وَكَلِمَاتِكَ التَّامَّةِ مِنْ شَرِّ مَا أَنْتَ آخِذٌ بِنَاصِيَتِهِ ، اللَّهُمَّ أَنْتَ تَكْشِفُ الْمَغْرَمَ وَالْمَأْثَمَ ، اللَّهُمَّ لَا يُهْزَمُ جُنْدُكَ ، وَلَا يُخْلَفُ وَعْدُكَ ، وَلَا يَنْفَعُ ذَا الْجَدِّ مِنْكَ الْجَدُّ ، سُبْحَانَكَ وَبِحَمْدِكَ )\n" +
                    "\n" +
                    "رواه أبو داود"
            else -> "عَنْ أَبِي الْأَزْهَرِ الْأَنْمَارِيِّ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا أَخَذَ مَضْجَعَهُ مِنْ اللَّيْلِ قَالَ : ( بِسْمِ اللَّهِ وَضَعْتُ جَنْبِي ، اللَّهُمَّ اغْفِرْ لِي ذَنْبِي ، وَأَخْسِئْ شَيْطَانِي ، وَفُكَّ رِهَانِي ، وَاجْعَلْنِي فِي النَّدِيِّ الْأَعْلَى ) رواه أبو داود"
        }
        return hadith
    }

    /**
     * function to get a random number of hadithNumbers
     * And then pass this number to the when function above
     */
    private fun roll(): Int {
        return (1..14).random()
    }
}