package com.moataz.afternoonhadeeth.data.source

class ZekrData {

    private val zekrList = arrayListOf(
        "سبحان اللّه وبحمده سبحان اللّه العظيم",
        "اللهم قنا عذابك يوم يبعث عبادك",
        "أعوذ بكلمات اللّه التّامّات من شرّ ما خلق",
        "لا إله إلّا اللّه وحده لا شريك له",
        "اللهم أغفر لنا وأرحمنا وعافنا",
        "رضيت بالله ربا وبالإسلام دينا",
        "لا حول ولا قوة إلا بالله",
        "رَبِّ إغفر وإرحم وتجاوز عما تعلم",
        "رَبِّ إغفر وإرحم وتجاوز عما تعلم",
        "ربنا تقبل منا إنك أنت السميع العليم",
        "ربنا آتنا في الدنيا حسنة وفي الآخرة حسنة",
        "سبحان اللّه العظيم وبحمده",
        "ربنا لا تؤاخذنا إن نسينا أو أخطأنا",
        "رب هب لي حكما والحقني بالصالحين",
        "رب أوزعني أن أشكر نعمتك التي أنعمت علي",
        "سبحان اللّه والحمدلله ولا إله إلا الله",
        "اللهم علمنا ماينفعنا وأنفعنا بما علمتنا",
        "اللهم صلِّ و سلِّم على نبينا محمد",
        "أستغفر اللّه العظيم وأتوب إليه",
        "رَبِّ اشْرَحْ لِي صَدْرِي وَيَسِّرْ لِي أَمْرِي",
        "رب إغفر لي ولوالدي",
        "اللهم إني أعوذ بك من الكفر والفقر",
        "اللهم إني أعوذ بك من عذاب القبر",
        "اللهم إني أعوذ بك من عذاب العجز والكسل",
        "اللهم إني أعوذ بك من شر البلاء",
        "ربنا آمنا فأغفر لنا وارحمنا"
    )

    fun getZekr(): String {
        val random = (0 until zekrList.size).random()
        if (random == zekrList.lastIndex) {
            return getZekr()
        }
        return zekrList[random]
    }
}