package com.moataz.afternoonhadeeth.ui.offline.viewmodel

import androidx.lifecycle.LiveData
import androidx.lifecycle.MutableLiveData
import androidx.lifecycle.ViewModel
import com.moataz.afternoonhadeeth.data.model.offline.HadithOffline
import com.moataz.afternoonhadeeth.utils.status.Resource
import java.util.*

class HadithOfflineViewModel : ViewModel() {
    private val hadithLiveData = MutableLiveData<Resource<List<HadithOffline>>>()
    private val hadithOfflineArrayList: MutableList<HadithOffline> = ArrayList()

    val hadithList: LiveData<Resource<List<HadithOffline>>>
        get() {
            hadithLiveData.postValue(Resource.success(hadithOfflineArrayList))
            populateList()
            return hadithLiveData
        }

    private fun populateList() {
        hadithOfflineArrayList.add(
            HadithOffline(
                "عن أبي موسى الأشعري رضي الله عنه عن النبي صلى الله عليه وسلم قال: (تعاهدوا القرآن، فوالذي نفسي بيده لهو أشد تفصيِّا من الإبل في عُقُلها)",
                "رواه البخاري"
            )
        )
        hadithOfflineArrayList.add(
            HadithOffline(
                "عن عبدالله بن عمر رضي الله عنه أن رسول الله صلى الله عليه وسلم قال: (لا حسد إلا في اثنتين: رجل آتاه الله القرآن فهو يقوم به آناء الليل وآناء النهار، ورجل آتاه الله مالاً فهو ينفقه آناء الليل وآناء النهار)",
                "رواه مسلم"
            )
        )
        hadithOfflineArrayList.add(
            HadithOffline(
                "عن أنس رضي الله عنه قال: كان أكثر دعاء النبي صلى الله عليه وسلم: (اللهم ربنا آتنا في الدنيا حسنة وفي الآخرة حسنة وقنا عذاب النار)",
                "رواه البخاري"
            )
        )
        hadithOfflineArrayList.add(
            HadithOffline(
                "عن عمر بن الخطاب رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: (إن الله يرفع بهذا الكتاب أقواما، ويضع به آخرين)",
                "رواه مسلم"
            )
        )
        hadithOfflineArrayList.add(
            HadithOffline(
                "عن أبي هريرة رضي الله عنه قال: كان رسول الله صلى الله عليه وسلم يقول: (اللهم أصلح لي ديني الذي هو عصمة أمري، وأصلح لي دنياي التي فيها معاشي، وأصلح لي آخرتي التي فيها معادي، واجعل الحياة زيادة لي في كل خير، واجعل الموت راحة لي من كل شر)",
                "رواه مسلم"
            )
        )
        hadithOfflineArrayList.add(
            HadithOffline(
                "عن عبدالله بن مسعود رضي الله عنه عن النبي صلى الله عليه وسلم أنه كان يقول: (اللهم إني أسألك الهدى والتقى، والعفاف والغنى)",
                "رواه مسلم"
            )
        )
        hadithOfflineArrayList.add(
            HadithOffline(
                "عَنْ أَبي سَعِيدٍ الخُدْرِي: أنَّ النَّبيَّ ﷺ قَال: لِكُلِّ غَادِرٍ لِواءٌ عِندَ اسْتِه يَوْمَ القِيامةِ، يُرْفَعُ لَهُ بِقَدْرِ غَدْرِهِ، ألَا وَلا غَادر أعْظمُ غَدْرًا مِنْ أمِيرِ عامَّةٍ ",
                "رواه مسلم"
            )
        )
        hadithOfflineArrayList.add(
            HadithOffline(
                "عن أبي هريرة رضي الله عنه عن رسول الله صلى الله عليه وسلم قال: (لا تقوم الساعة حتى تقاتلوا اليهود، حتى يقول الحجر وراءه اليهودي: يا مسلم، هذا يهودي ورائي فاقتله)",
                "رواه البخاري"
            )
        )
        hadithOfflineArrayList.add(
            HadithOffline(
                "عن سهل بن حَنيف رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: (من سأل الله تعالى الشهادة بصدق بلَّغه الله منازل الشهداء وإن مات على فراشه)",
                "رواه مسلم"
            )
        )
        hadithOfflineArrayList.add(
            HadithOffline(
                "عن أبي موسى الأشعري رضي الله عنه أن رسول الله صلى الله عليه وسلم قال: (من قاتل لتكون كلمةُ الله هي العليا، فهو في سبيل الله)",
                "رواه البخاري"
            )
        )
        hadithOfflineArrayList.add(
            HadithOffline(
                "عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: (بدأ الإسلام غريبا، وسيعود كما بدأ غريبا، فطوبى للغرباء)",
                "رواه مسلم"
            )
        )
        hadithOfflineArrayList.add(
            HadithOffline(
                "عن أبي سعيد الخدري رضي الله عنه قال: سمعت رسول الله صلى الله عليه وسلم يقول: (من رأى منكم منكرا فليغيره بيده، فإن لم يستطع فبلسانه، فإن لم يستطع فبقلبه، وذلك أضعف الإيمان)",
                "رواه مسلم"
            )
        )
        hadithOfflineArrayList.add(
            HadithOffline(
                "قال رسول الله صلى الله عليه وسلم: (إن أحدكم إذا مات عُرض عليه مقعدُه بالغداة والعشي، إن كان من أهل الجنة فمن أهل الجنة، وإن كان من أهل النار فمن أهل النار، يقال: هذا مقعدك، حتى يبعثك الله إليه يوم القيامة)",
                "رواه مسلم"
            )
        )
        hadithOfflineArrayList.add(
            HadithOffline(
                "عن أبي هريرة رضي الله عنه أن رسول الله صلى الله عليه وسلم قال: (إذا مات الإنسان انقطع عمله إلا من ثلاث: صدقة جارية، أو علم ينتفع به، أو ولد صالح يدعو له)",
                "رواه البخاري"
            )
        )
        hadithOfflineArrayList.add(
            HadithOffline(
                "عن أبي هريرة رضي الله عنه أن رسول الله صلى الله عليه وسلم قال: (من شهد الجنازة حتى يصلي عليها فله قيراط، ومن شهدها حتى تدفن فله قيراطان) قيل: وما القيراطان؟ قال: (مثل الجبلين العظيمين)",
                "رواه البخاري"
            )
        )
        hadithOfflineArrayList.add(
            HadithOffline(
                "عن أنس رضي الله عنه عن النبي صلى الله عليه وسلم أنه قال: (يتبع الميت ثلاثة فيرجع اثنان ويبقى معه واحد، يتبعه أهله وماله وعمله، فيرجع أهله وماله، ويبقى عمله)",
                "رواه مسلم"
            )
        )
        hadithOfflineArrayList.add(
            HadithOffline(
                "عن أبي هريرة رضي الله عنه عن النبي صلى الله عليه وسلم قال: (دعوني ما تركتكم، إنما هلك من كان قبلكم بسؤالهم واختلافهم على أنبيائهم، فإذا نهيتكم عن شيء فاجتنبوه، وإذا أمرتكم بأمر فأتوا منه ما استطعتم)",
                "رواه البخاري"
            )
        )
        hadithOfflineArrayList.add(
            HadithOffline(
                "عن جابر رضي الله عنه قال: سمعت النبي صلى الله عليه وسلم قبل وفاته بثلاثٍ يقول: (لا يموتن أحدكم إلا وهو يُحسِن بالله الظن)",
                "رواه مسلم"
            )
        )
        hadithOfflineArrayList.add(
            HadithOffline(
                "عن شداد بن أوس رضي الله عنه عن النبي صلى الله عليه وسلم قال: (سيد الاستغفار أن تقول: اللهم أنت ربي لا إله إلا أنت، خلقتني وأنا عبدك، وأنا على عهدك ووعدك ما استطعت، أعوذ بك من شر ما صنعت، أبوء لك بنعمتك علي، وأبوء لك بذنبي، فاغفر لي، فإنه لا يغفر الذنوب إلا أنت)",
                "رواه البخاري"
            )
        )
        hadithOfflineArrayList.add(
            HadithOffline(
                "عن أبي هريرة رضي الله عنه أن النبي صلى الله عليه وسلم قال: (خير يوم طلعت عليه الشمس يوم الجمعة، فيه خلق آدم، وفيه أدخل الجنة، وفيه أخرج منها، ولا تقوم الساعة إلا في يوم الجمعة)",
                "رواه مسلم"
            )
        )
        hadithOfflineArrayList.add(
            HadithOffline(
                "عن أبي هريرة رضي الله عنه أن رسول الله صلى الله عليه وسلم قال:( إن الله يقول يوم القيامة: أين المتحابون بجلالي اليوم أظلهم في ظلي يوم لا ظل إلا ظلي) والمتحابين بجلاله هم المتحابون في الله",
                "رواه مسلم"
            )
        )
        hadithOfflineArrayList.add(
            HadithOffline(
                " عن أبي هريرة رضي الله عنه أن رسول الله صلى الله عليه وسلم قال: (لا تدخلوا الجنة حتى تؤمنوا، ولا تؤمنوا حتى تحابوا، أولا أدلكم على شيء إذا فعلتموه تحاببتم؟ أفشوا السلام بينكم)",
                "رواه مسلم"
            )
        )
        hadithOfflineArrayList.add(
            HadithOffline(
                "عن ابن عمر رضي الله عنهما أن رسول الله صلى الله عليه وسلم قال:( المسلم من سلم المسلمون من لسانه ويده والمهاجر من هجر ما نهى الله عنه)",
                "رواه البخاري"
            )
        )
        hadithOfflineArrayList.add(
            HadithOffline(
                "عن ابن عمر رضي الله عنهما أن رسول الله صلى الله عليه وسلم قال: (المسلم أخو المسلم لا يظلمه ولا يسلمه، من كان في حاجة أخيه كان الله في حاجته، ومن فرّج عن مسلم كربة فرج الله عنه بها كربة من كرب يوم القيامة، ومن ستر مسلماً ستره الله يوم القيامة)",
                "رواه مسلم"
            )
        )
        hadithOfflineArrayList.add(
            HadithOffline(
                "عن أبي هريرة رضي الله عنه قال: سمعت رسول الله صلى الله عليه وسلم يقول: (إذا أقيمت الصلاة، فلا تأتوها تسعون، وأتوها تمشون، عليكم السكينة، فما أدركتم فصلوا، وما فاتكم فأتموا)",
                "رواه البخاري"
            )
        )
        hadithOfflineArrayList.add(
            HadithOffline(
                "عن أبي هريرة رضي الله عنه عن النبي صلى الله عليه وسلم قال: (تُنكح المرأة لأربع: لمالها، ولحسبها، ولجمالها، ولدينها، فاظفر بذات الدين تَرِبَت يداك)",
                "رواه مسلم"
            )
        )
        hadithOfflineArrayList.add(
            HadithOffline(
                "عن أبي هريرة رضي الله عنه قال: أوصاني خليلي صلى الله عليه وسلم بثلاث: (صيام ثلاثة أيام من كل شهر، وركعتي الضحى، وأن أوتر قبل أن أنام)",
                "رواه البخاري"
            )
        )
        hadithOfflineArrayList.add(
            HadithOffline(
                "عن أبي هريرة رضي الله عنه أن رسول الله صلى الله عليه وسلم قال: (ليس الشديد بالصرعة، إنما الشديد الذي يملك نفسه عند الغضب)",
                "رواه مسلم"
            )
        )
        hadithOfflineArrayList.add(
            HadithOffline(
                "عن أبي هريرة رضي الله عنه أن رسول الله صلى الله عليه وسلم قال: (من دعا إلى هدى كان له من الأجر مثل أجور من تبعه لا ينقص ذلك من أجورهم شيئاً ومن دعا إلى ضلالة كان عليه من الإثم مثل آثام من تبعه لا ينقص ذلك من آثامهم شيئاً)",
                "رواه مسلم"
            )
        )
        hadithOfflineArrayList.add(
            HadithOffline(
                "عن أبي سعيد الخدري رضي الله عنه أن النبي صلى الله عليه وسلم قال: (لتتبعن سَنَن من قبلَكم شِبرا بشبر، وذراعا بذراع، حتى لو سلكوا جُحر ضبٍ لسلكتموه)، قلنا يا رسول الله: اليهود، والنصارى قال: (فمن؟!)",
                "رواه البخاري"
            )
        )
    }
}